{
    "MENUCONTACT": "Kontakt",
    "MENUPROJECT": "Projekte",
    "MENUSKILLS": "Skills",
    "MENUWHYME": "Warum ich",
    "MYSKILLSET": "Meine Skills",
    "ROLE": "Frontend Entwickler",
    "INTRODUCTIONSKILLS": "Ich bin ein engagierter Frontend-Entwickler mit Erfahrung in der Umsetzung moderner Webanwendungen. In verschiedenen Projekten konnte ich meine Fähigkeiten in HTML, CSS, SCSS, JavaScript und TypeScript gezielt einsetzen. Mein technischer Hintergrund als Bachelor of Engineering hilft mir, auch komplexe Anforderungen strukturiert und effizient umzusetzen. Ich arbeite routiniert mit Angular, REST-APIs, Firebase, Material Design und Git. Die Prinzipien von SCRUM sind mir durch Projektarbeit bestens vertraut. Besonders wichtig ist mir sauberes UI-Design mit klarer Logik, starker Nutzerführung und Wiederverwendbarkeit der Komponenten. Dabei setze ich auf moderne Gestaltungsmuster wie Material Design, um nutzerfreundliche und responsive Interfaces zu entwickeln. Ich bin immer neugierig auf neue Technologien und bringe die Bereitschaft mit, mich stetig weiterzuentwickeln und Neues zu lernen.",
    "MOTIVATION": "Ich bin lernbereit, technikbegeistert und entwickle gern kreative, moderne Lösungen. Neue Tools und Technologien probiere ich mit Neugier aus und halte mich über aktuelle Frontend-Trends stets auf dem Laufenden – für zukunftssichere und durchdachte Anwendungen.",
    "WRITESOMEINFO":"Schon im Bachelor‐Studium hat mich das Programmieren gepackt – besonders die Kombination aus kniffliger Logik und UIs. Es fasziniert mich einfach, was man mit ein bisschen Code alles bauen kann. Deshalb bleibe ich immer am Ball und lerne fleißig neue Techniken.",
    "IM": "Ich bin",
    "LOCALE": "beheimatet in Frankfurt am Main",
    "REMOTE": "offen für Remote-Arbeit",
    "CONTACTME": "Kontaktaufnahme",
    "---": "",
    "ABOUTPROJECT": "Über das Projekt",
    "TECHNOLOGIES": "Von mir verwendete Technologien",
    "WHATLEARNED": "Was habe ich gelernt",
    "NEEDATEAMPLAYER":"Brauchen Sie einen Teamplayer?",
    "----": "",
    "JEXPLAINPROJECT": "Aufgabenmanager nach dem Vorbild des Kanban-Systems. Erstellen und organisieren Sie Aufgaben mit Hilfe von Drag-and-Drop-Funktionen, weisen Sie Benutzer und Kategorien zu.",
    "JLEARNED": "Im Projekt habe ich agile Methoden wie Scrum kennengelernt, die eine effektive Teamarbeit fördern. Durch die gemeinsame Nutzung von Git wurden Merge-Konflikte erfolgreich gelöst.",
    "EPLEXPLAINPROJECT": "El Pollo Loco ist ein kleines, herausforderndes Browser-Spiel, in dem Gegner durch Sprünge besiegt, Flaschen eingesammelt und schließlich das verrückte, große Huhn bezwungen wird.",
    "EPLLEARNED": "Ein Browser-Spiel mit objektorientierter Programmierung wurde umgesetzt, das interaktive Elemente und dynamische Spielmechaniken integriert. Dabei habe ich praxisnah gelernt, wie OOP-Konzepte im Spielkontext angewendet und weiterführende Funktionen implementiert werden.",
    "PEXPLAINPROJECT": "Ein Pokedex ist eine digitale Enzyklopädie, in der alle Pokémon-Arten samt ihren Eigenschaften, Fähigkeiten und Entwicklungen erfasst sind. Er dient als Nachschlagewerk.",
    "PLEARNED": "Im Pokedex-Projekt habe ich eine API integriert, um relevante Pokémon-Daten abzurufen und diese in ansprechenden Bildern darzustellen. Dabei konnte ich den Umgang mit API-Informationen und deren visuelle Aufbereitung praxisnah erlernen.",
    "-----": "",
    "ONGOINGPROJECT": "Angehendes Projekt",
    "ONGOINGTEXT": "Momentan arbeite ich an keinem festen Projekt, sondern nutze die Zeit, um meine Skills in Angular, TypeScript und Webdesign weiter auszubauen. Für mich gehören eine gute Planung und saubere Umsetzung einfach dazu, wenn am Ende etwas richtig Gutes entstehen soll.",
    "LETSTALK": "Lass uns reden",
    "WHATCOLLEAGUESSAID": "Hier, was meine Kollegen über mich gesagt haben",
    "------": "",
    "REFERENCE": "Referenzen",
    "REFERENCE_1": "„Boban ist ein ruhiger und ausgeglichener Programmierer, der auch in herausfordernden Situationen den Überblick behält. Mit seiner konzentrierten und überlegten Arbeitsweise löst er Probleme strukturiert und zuverlässig. Seine ruhige Art wirkt sich positiv auf die Teamarbeit aus und sorgt für eine angenehme Zusammenarbeit.“",
    "REFERENCE_2": "„Boban überzeugt durch seine strukturierte Arbeitsweise und seine starke Teamorientierung. Auf ihn ist jederzeit Verlass – sowohl fachlich als auch menschlich.“",
    "REFERENCE_3": "„Boban bringt nicht nur technisches Know-how mit, sondern auch den Willen, sich ständig weiterzuentwickeln. Seine Leidenschaft für Frontend-Entwicklung zeigt sich in jedem Projekt.“",
    "-------": "",
    "PRIVACY_TEXT": "Ich habe die <a href='{{url}}' class='ct-fffdfd pp-text' target='_blank' rel='noopener noreferrer'>Datenschutzerklärung</a> gelesen und bin mit der darin beschriebenen Verarbeitung meiner Daten einverstanden.",
    "LETUSWORKTOGETHER": "💬 Lassen Sie uns ins Gespräch kommen!",
    "ENCOURAGETEXT": "Ich freue mich über jede Gelegenheit, mich neuen Herausforderungen zu stellen und meine Fähigkeiten weiter auszubauen. Besonders interessieren mich Aufgaben im Frontend-Bereich, bei denen Benutzerfreundlichkeit, Design und Technik zusammenspielen – etwa in der Entwicklung moderner, responsiver Webanwendungen mit Angular oder ähnlichen Frameworks. Ich bin überzeugt, mit meinem technischen Know-how, meiner Lernbereitschaft und meiner Begeisterung für sauberen Code einen wertvollen Beitrag in einem engagierten Team leisten zu können. Mein Ziel ist es, mich stetig weiterzuentwickeln und gemeinsam mit anderen innovative Lösungen zu gestalten.</br> 📩 Kontaktieren Sie mich gerne – ich freue mich auf spannende Gespräche und Projekte!",
    "LEGALNOTICE": "Impressum",
    "PRIVACYPOLICY": "Datenschutzerklärung",
    "YOURNAME":"Dein Name",
    "ENTERNAME1":"Bitte Name eingeben",
    "ENTERNAME":"Bitte geben Sie mindestens 3 Buchstaben ein",
    "YOUREMAIL":"Deine E-Mail-Adresse",
    "ENTEREMAIL1":"Deine E-Mail-Adresse eingeben",
    "ENTEREMAIL":"Beispiel max@mustermann.de",
    "ENTERMESSAGE":"Bitte geben Sie eine Nachricht ein",
    "CHECKBOX_REQUIRED":"Bitte Haken setzen",
    "SHOWMEMORE":"Zeig mir mehr",
    "SHOWMELESS":"Zeig mir weniger",
    "SEND_BTN":"senden",
    "PROJECTS": [
        {
            "id": 1,
            "title": "Projekt Join",
            "description": "Aufgabenmanager nach dem Vorbild des Kanban-Systems. Erstellen und organisieren Sie Aufgaben mit Hilfe von Drag-and-Drop-Funktionen, weisen Sie Benutzer und Kategorien zu.",
            "technologies": "JavaScript, Firebase, HTML, CSS, Scrum",
            "learned": "Im Projekt habe ich agile Methoden wie Scrum kennengelernt, die eine effektive Teamarbeit fördern. Durch die gemeinsame Nutzung von Git wurden Merge-Konflikte erfolgreich gelöst.",
            "screenshot": "../../../assets/img/screenshot_join.svg",
            "githubUrl": "https://github.com/Bobi-DA/join",
            "liveUrl": "https://boban-jakovljevic.de/join",
            "expanded": false
        },
        {
            "id": 2,
            "title": "Projekt El Pollo Loco",
            "description": "El Pollo Loco ist ein kleines, herausforderndes Browser-Spiel, in dem Gegner durch Sprünge besiegt, Flaschen eingesammelt und schließlich das verrückte, große Huhn bezwungen wird.",
            "technologies": "JavaScript, HTML, CSS",
            "learned": "Ein Browser-Spiel mit objektorientierter Programmierung wurde umgesetzt, das interaktive Elemente und dynamische Spielmechaniken integriert. Dabei habe ich praxisnah gelernt, wie OOP-Konzepte im Spielkontext angewendet und weiterführende Funktionen implementiert werden.",
            "screenshot": "../../../assets/img/screenshot_loco.svg",
            "githubUrl": "https://github.com/Bobi-DA/EPL",
            "liveUrl": "https://boban-jakovljevic.de/elPolloLoco",
            "expanded": false
        },
        {
            "id": 3,
            "title": "Projekt Pokedex",
            "description": "Ein Pokedex ist eine digitale Enzyklopädie, in der alle Pokémon-Arten samt ihren Eigenschaften, Fähigkeiten und Entwicklungen erfasst sind. Er dient als Nachschlagewerk.",
            "technologies": "JavaScript, REST-API, CSS, HTML",
            "learned": "Im Pokedex-Projekt habe ich eine API integriert, um relevante Pokémon-Daten abzurufen und diese in ansprechenden Bildern darzustellen. Dabei konnte ich den Umgang mit API-Informationen und deren visuelle Aufbereitung praxisnah erlernen.",
            "screenshot": "../../../assets/img/screenshot_pokedex.png",
            "githubUrl": "https://github.com/Bobi-DA/Pokedex",
            "liveUrl": "https://boban-jakovljevic.de/pokedex",
            "expanded": false
        }
    ]
}