{
    "MENUCONTACT": "Kontakt",
    "MENUPROJECT": "Projekte",
    "MENUSKILLS": "Skills",
    "MENUWHYME": "Warum ich",
    "ROLE": "Frontend Entwickler",
    "LOCALE": "beheimatet in Frankfurt am Main",
    "REMOTE": "offen für Remote-Arbeit",
    "CONTACTME": "Kontakt aufnehmen",
    "---": "",
    "ABOUTPROJECT": "Über das Projekt",
    "TECHNOLOGIES": "Von mir verwendete Technologien",
    "WHATLEARNED": "Was habe ich gelernt",
    "----": "",
    "JEXPLAINPROJECT": "Aufgabenmanager nach dem Vorbild des Kanban-Systems. Erstellen und organisieren Sie Aufgaben mit Hilfe von Drag-and-Drop-Funktionen, weisen Sie Benutzer und Kategorien zu.",
    "JLEARNED": "Im Projekt habe ich agile Methoden wie Scrum kennengelernt, die eine effektive Teamarbeit fördern. Durch die gemeinsame Nutzung von Git wurden Merge-Konflikte erfolgreich gelöst.",
    "EPLEXPLAINPROJECT": "El Pollo Loco ist ein kleines, herausforderndes Browser-Spiel, in dem Gegner durch Sprünge besiegt, Flaschen eingesammelt und schließlich das verrückte, große Huhn bezwungen wird.",
    "EPLLEARNED": "Ein Browser-Spiel mit objektorientierter Programmierung wurde umgesetzt, das interaktive Elemente und dynamische Spielmechaniken integriert. Dabei habe ich praxisnah gelernt, wie OOP-Konzepte im Spielkontext angewendet und weiterführende Funktionen implementiert werden.",
    "PEXPLAINPROJECT": "Ein Pokedex ist eine digitale Enzyklopädie, in der alle Pokémon-Arten samt ihren Eigenschaften, Fähigkeiten und Entwicklungen erfasst sind. Er dient als Nachschlagewerk.",
    "PLEARNED": "Im Pokedex-Projekt habe ich eine API integriert, um relevante Pokémon-Daten abzurufen und diese in ansprechenden Bildern darzustellen. Dabei konnte ich den Umgang mit API-Informationen und deren visuelle Aufbereitung praxisnah erlernen.",
    "-----": "",
    "ONGOINGPROJECT": "Angehendes Projekt",
    "ONGOINGTEXT": "Arbeiten Sie derzeit an einem Projekt? Worum geht es dabei und welche Technologien verwenden Sie? Betonen Sie, dass eine gute Planung und Ausführung für den Erfolg Ihrer Arbeit und die Erzielung großartiger Ergebnisse unerlässlich sind.",
    "LETSTALK": "Lass uns reden",
    "------": "",
    "REFERENCE_1": "„Michael ist ein zuverlässiger und freundlicher Mensch. Er arbeitet strukturiert und schreibt einen klaren Code. Ich empfehle ihn als Kollegen.“",
    "REFERENCE_2": "„Michael ist ein zuverlässiger und freundlicher Mensch. Er arbeitet strukturiert und schreibt einen klaren Code. Ich empfehle ihn als Kollegen.“",
    "REFERENCE_3": "„Michael ist ein zuverlässiger und freundlicher Mensch. Er arbeitet strukturiert und schreibt einen klaren Code. Ich empfehle ihn als Kollegen.“",
    "-------": "",
    "ACCEPTPRIVACYPOLICE": "Ich habe die Datenschutzerklärung gelesen und bin mit der darin beschriebenen Verarbeitung meiner Daten einverstanden.",
    "LETUSWORKTOGETHER": "Lassen Sie uns zusammenarbeiten.",
    "ENCOURAGETEXT": "Ermutigen Sie die Leute, mit Ihnen Kontakt aufzunehmen und beschreiben Sie, an welcher Aufgabe Sie interessiert sind. Drücken Sie Ihr Vertrauen in Ihre Fähigkeit aus, durch Ihr Fachwissen und Ihren Enthusiasmus, Ihre Fähigkeiten zu verbessern, einen sinnvollen Beitrag zu einem Team zu leisten.",
    "LEGALNOTICE": "Impressum",
    "PRIVACYPOLICY":"Datenschutzerklärung"
}