{
    "MENUCONTACT": "Contact",
    "MENUPROJECT": "Projects",
    "MENUSKILLS": "Skills",
    "MENUWHYME": "Why me",
    "MYSKILLSET": "My Skill Set",
    "ROLE": "Frontend Developer",
    "INTRODUCTIONSKILLS": "I am a dedicated front-end developer with experience in implementing modern web applications. In various projects I was able to use my skills in HTML, CSS, SCSS, JavaScript and TypeScript. My technical background as a Bachelor of Engineering helps me to implement even complex requirements in a structured and efficient manner. I work confidently with Angular, REST APIs, Firebase, Material Design and Git. I am very familiar with the principles of SCRUM through project work. Clean UI design with clear logic, strong user guidance and reusability of components is particularly important to me. I rely on modern design patterns such as material design to develop user-friendly and responsive interfaces. I am always curious about new technologies and have the willingness to constantly develop and learn new things.",
    "MOTIVATION": "I am eager to learn, enthusiastic about technology and enjoy developing creative, modern solutions. I am curious to try out new tools and technologies and always keep up to date with the latest frontend trends - for future-proof and well thought-out applications.",
    "WRITESOMEINFO":"I was already hooked on programming during my bachelor's degree - especially the combination of tricky logic and UIs. I'm simply fascinated by what you can build with a bit of code. That's why I always stay on the ball and keep learning new techniques.",
    "IM": "I am",
    "LOCALE": "located in Frankfurt am Main",
    "REMOTE": "open to work remote",
    "CONTACTME": "Contact me",
    "---": "",
    "ABOUTPROJECT": "About the project",
    "TECHNOLOGIES": "Technologies I have used",
    "WHATLEARNED": "What I have learned",
    "NEEDATEAMPLAYER":"Need a teamplayer?",
    "----": "",
    "JEXPLAINPROJECT": "Task manager modeled on the Kanban system. Create and organize tasks using drag-and-drop functionality, and assign users and categories.",
    "JLEARNED": "In the project, I learned about agile methods like Scrum, which promote effective teamwork. Merge conflicts were successfully resolved through shared use of Git.",
    "EPLEXPLAINPROJECT": "El Pollo Loco is a small, challenging browser game in which you defeat enemies by jumping, collect bottles and finally defeat the crazy, big chicken.",
    "EPLLEARNED": "A browser game with object-oriented programming was implemented that integrates interactive elements and dynamic game mechanics. I learned how to apply OOP concepts in a game context and how to implement advanced functions.",
    "PEXPLAINPROJECT": "A Pokedex is a digital encyclopaedia that lists all Pokémon types, including their characteristics, abilities and evolutions. It serves as a reference work.",
    "PLEARNED": "In the Pokedex project, I integrated an API to retrieve relevant Pokémon data and display it in appealing images. This allowed me to learn how to handle API information and its visual presentation in a practical way.",
    "-----": "",
    "ONGOINGPROJECT": "Ongoing project",
    "ONGOINGTEXT": "I'm not currently working on a specific project, but am using the time to further develop my skills in Angular, TypeScript, and web design. For me, good planning and clean implementation are essential if you want to create something truly good.",
    "LETSTALK": "Let's talk",
    "WHATCOLLEAGUESSAID": "Here what my colleagues said about me",
    "------": "",
    "REFERENCE": "Reference",
    "REFERENCE_1": "„Boban is a calm and even-tempered programmer who keeps an overview even in challenging situations. With his concentrated and thoughtful way of working, he solves problems in a structured and reliable manner. His calm manner has a positive effect on teamwork and ensures pleasant collaboration.“",
    "REFERENCE_2": "„Boban impresses with his structured way of working and his strong team orientation. You can always rely on him - both professionally and personally.“",
    "REFERENCE_3": "„Boban not only has technical know-how, but also the will to constantly develop himself further. His passion for front-end development is evident in every project.“",
    "-------": "",
    "PRIVACY_TEXT": "I've read the <a href='{{url}}' class='ct-fffdfd pp-text' target='_blank' rel='noopener noreferrer'>privacy policy</a> and agree to the processing of my data as described.",
    "PRIVACY_TITLE": "Privacy&shy;Policy",
    "LETUSWORKTOGETHER": "Let us work together.",
    "ENCOURAGETEXT": "Encourage people to contact you and describe what role you are interested in. Express confidence in your ability to make a meaningful contribution to a team through your expertise and enthusiasm for improving your skills.",
    "PRIVACY_TXT":"Privacy police",
    "LEGALNOTICE": "Legal notice",
    "INFOPARATGM":"Information according to § 5 TMG",
    "CONTACT_TXT":"Contact:",
    "RESPPARARSTV":"Responsible for the content according to § 55 para. 2 RStV:",
    "COUNTRY":"Germany",
    "PRIVACYPOLICY": "privacy policy",
    "YOURNAME":"Your name",
    "ENTERNAME1":"Please enter your name",
    "ENTERNAME":"Please enter at least 3 letters",
    "YOUREMAIL":"Your e-mail",
    "ENTEREMAIL1":"Please enter an e-mail",
    "ENTEREMAIL":"Explain max@mustermann.de",
    "ENTERMESSAGE":"Please enter a message",
    "CHECKBOX_REQUIRED":"Please check the box",
    "SHOWMEMORE": "Show me more",
    "SHOWMELESS": "show me less",
    "SEND_BTN":"send",
    "FORM_SUCCESS": "Message sent successfully!",

    "PROJECTS": [
        {
            "id": 1,
            "title": "Project Join",
            "description": "Task manager modeled on the Kanban system. Create and organize tasks using drag-and-drop functions, assign users and categories.",
            "technologies": "JavaScript, Firebase, HTML, CSS, Scrum",
            "learned": "During the project, I got to know agile methods such as Scrum, which promote effective teamwork. Merge conflicts were successfully resolved through the shared use of Git.",
            "screenshot": "../../../assets/img/screenshot_join.svg",
            "githubUrl": "https://github.com/",
            "liveUrl": "https://boban-jakovljevic.de/join",
            "expanded": false
        },
        {
            "id": 2,
            "title": "Project El Pollo Loco",
            "description": "El Pollo Loco is a small, challenging browser game in which you defeat enemies by jumping, collect bottles and finally defeat the crazy, big chicken.",
            "technologies": "JavaScript, HTML, CSS",
            "learned": "A browser game with object-oriented programming was implemented that integrates interactive elements and dynamic game mechanics. I learned how to apply OOP concepts in a game context and how to implement advanced functions.",
            "screenshot": "../../../assets/img/screenshot_loco.svg",
            "githubUrl": "https://github.com/",
            "liveUrl": "https://boban-jakovljevic.de/elPolloLoco",
            "expanded": false
        },
        {
            "id": 3,
            "title": "Project Pokedex",
            "description": "A Pokedex is a digital encyclopaedia that lists all Pokémon types, including their characteristics, abilities and evolutions. It serves as a reference work.",
            "technologies": "JavaScript, REST-API, CSS, HTML",
            "learned": "In the Pokedex project, I integrated an API to retrieve relevant Pokémon data and display it in appealing images. This allowed me to learn how to handle API information and its visual presentation in a practical way.",
            "screenshot": "../../../assets/img/screenshot_pokedex.png",
            "githubUrl": "https://github.com/…",
            "liveUrl": "https://boban-jakovljevic.de/pokedex",
            "expanded": false
        }
    ]
}